studyapppw1/src/Documents/РасходМатериалов/РасходМатериалов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходМатериалов</name>
  <registerRecords>AccumulationRegister.ОстаткиМатериалов</registerRecords>
  <attributes>
    <name>Производство</name>
    <type>
      <types>DocumentRef.Производство</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Материалы</name>
    <attributes>
      <name>Материал</name>
      <type>
        <types>CatalogRef.Материалы</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

studyapppw1/src/Documents/РасходМатериалов/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПроизводствоПриИзменении(Элемент)

ЗаполнитьМатериалыИзПроизводства();

КонецПроцедуры          

&НаКлиенте
Процедура ЗаполнитьМатериалыИзПроизводства()

    Если Объект.Производство = Неопределено Тогда
        Сообщить("Выберите документ 'Производство'.");
        Возврат;
    КонецЕсли;

    Данные = ПолучитьМатериалыПроизводстваНаСервере(Объект.Производство);

    Объект.Материалы.Очистить();

    Для Каждого СтрДанных Из Данные Цикл
        НоваяСтрока = Объект.Материалы.Добавить();
        НоваяСтрока.Материал = СтрДанных.Материал;
        НоваяСтрока.Количество = СтрДанных.Количество;
    КонецЦикла;

    Элементы.Материалы.Обновить();

КонецПроцедуры

&НаСервере
Функция ПолучитьМатериалыПроизводстваНаСервере(ПроизводствоСсылка) Экспорт

    Результат = Новый Массив;

    Если ПроизводствоСсылка = Неопределено Тогда
        Возврат Результат;
    КонецЕсли;

    Попытка
        ОбъектПроизводство = ПроизводствоСсылка.ПолучитьОбъект();
    Исключение
        Возврат Результат;
    КонецПопытки;


    Для Каждого Стр Из ОбъектПроизводство.Материалы Цикл
        Если Стр.Материал = Неопределено Тогда
            Продолжить;
        КонецЕсли;

        Кол = ?(Стр.Количество = Неопределено, 0, Стр.Количество);

        Результат.Добавить(Новый Структура("Материал,Количество", Стр.Материал, Кол));
    КонецЦикла;

    Возврат Результат;

КонецФункции
